Revit 2027 API
WorksharingDisplaySettings.GetRemovedUsers Method
 Returns the set of users who have been explicitly removed from the settings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<string> GetRemovedUsers()
Public Function GetRemovedUsers As ICollection(Of String)
public:
ICollection<String^>^ GetRemovedUsers()
member GetRemovedUsers : unit -> ICollection<string>
Return Value
ICollection<String>
 Users who have been explicitly removed from the list.
See Also
Reference
WorksharingDisplaySettings Class
Autodesk.Revit.DB Namespace